In [1]:
people = {
    "first": ["Georgi", 'Jane', 'John'], 
    "last": ["Alexandrov", 'Smith', 'Doe'], 
    "email": ["georgialexandrov@gmail.com", 'JaneSmith@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [5]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [6]:
df.columns = ['first_name', 'last_name', 'email']

In [7]:
df

  first_name   last_name                       email
0     Georgi  Alexandrov  georgialexandrov@gmail.com
1       Jane       Smith         JaneSmith@email.com
2       John         Doe           JohnDoe@email.com

In [8]:
df.columns = [x.lower() for x in df.columns]
df

  first_name   last_name                       email
0     Georgi  Alexandrov  georgialexandrov@gmail.com
1       Jane       Smith         JaneSmith@email.com
2       John         Doe           JohnDoe@email.com

In [9]:
df.rename(columns={'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [10]:
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [11]:
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John       Smith         JohnSmith@email.com

In [12]:
df.loc[2, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [13]:
df.loc[2, 'last'] = 'Smith'
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John       Smith           JohnDoe@email.com

In [14]:
df.at[2, 'last'] = 'Doe'
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         JaneSmith@email.com
2    John         Doe           JohnDoe@email.com

In [15]:
filt = (df['email'] == 'JohnDoe@email.com')
df.loc[filt, 'last'] = 'Smith'

In [16]:
df['email'] = df['email'].str.upper()

In [17]:
df['email'].apply(len)

0    26
1    19
2    17
Name: email, dtype: int64

In [18]:
def update_email(email):
    return email.upper()

In [19]:
df['email'].apply(update_email)

0    GEORGIALEXANDROV@GMAIL.COM
1           JANESMITH@EMAIL.COM
2             JOHNDOE@EMAIL.COM
Name: email, dtype: object

In [20]:
df['email'] = df['email'].apply(update_email)

In [21]:
df['email'] = df['email'].apply(lambda x: x.lower())
df

    first        last                       email
0  Georgi  Alexandrov  georgialexandrov@gmail.com
1    Jane       Smith         janesmith@email.com
2    John       Smith           johndoe@email.com

In [22]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [23]:
df.apply(lambda x: x.min())

first                        Georgi
last                     Alexandrov
email    georgialexandrov@gmail.com
dtype: object

In [24]:
df.applymap(len)

   first  last  email
0      6    10     26
1      4     5     19
2      4     5     17

In [25]:
df['first'].map({'Georgi': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [26]:
df['first'] = df['first'].replace({'Georgi': 'Chris', 'Jane': 'Mary'})
df['email'] = df['email'].replace({'georgialexandrov@gmail.com': 'chrisalexandrov@gmail.com',
                                   'janesmith@email.com': 'marysmith@email.com',
                                   'johndoe@email.com' : 'johnsmith@email.com'})

In [27]:
df

   first        last                      email
0  Chris  Alexandrov  chrisalexandrov@gmail.com
1   Mary       Smith        marysmith@email.com
2   John       Smith        johnsmith@email.com

In [28]:
df['full_name'] = df['first']+ ' ' + df['last']

In [29]:
df.drop(columns = ['first', 'last'], inplace=True)

In [30]:
df['full_name'].str.split(' ', expand=True)

       0           1
0  Chris  Alexandrov
1   Mary       Smith
2   John       Smith

In [31]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [32]:
df

                       email         full_name  first        last
0  chrisalexandrov@gmail.com  Chris Alexandrov  Chris  Alexandrov
1        marysmith@email.com        Mary Smith   Mary       Smith
2        johnsmith@email.com        John Smith   John       Smith

In [33]:
people = {
    "first": ["Matt", 'Harry', 'Betty'], 
    "last": ["Damon", 'Potter', 'Spring'], 
    "email": ["mattdamon@gmail.com", 'harrypotter@email.com', 'bettyspring@email.com']
}
df2 = pd.DataFrame(people)

In [34]:
frames = [df, df2]

In [35]:
result = pd.concat(frames)

In [36]:
result

                       email         full_name  first        last
0  chrisalexandrov@gmail.com  Chris Alexandrov  Chris  Alexandrov
1        marysmith@email.com        Mary Smith   Mary       Smith
2        johnsmith@email.com        John Smith   John       Smith
0        mattdamon@gmail.com               NaN   Matt       Damon
1      harrypotter@email.com               NaN  Harry      Potter
2      bettyspring@email.com               NaN  Betty      Spring

In [37]:
df = df.append(df2, ignore_index=True)

C:\Users\grg_a\AppData\Local\Temp\ipykernel_15540\445450659.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True)

In [38]:
filt = df['last'] == 'Potter'
df.drop(index = df[filt].index)

                       email         full_name  first        last
0  chrisalexandrov@gmail.com  Chris Alexandrov  Chris  Alexandrov
1        marysmith@email.com        Mary Smith   Mary       Smith
2        johnsmith@email.com        John Smith   John       Smith
3        mattdamon@gmail.com               NaN   Matt       Damon
5      bettyspring@email.com               NaN  Betty      Spring

In [43]:
df.sort_values(by=['first', 'last'], ascending=False)

                       email         full_name  first        last
3        mattdamon@gmail.com               NaN   Matt       Damon
1        marysmith@email.com        Mary Smith   Mary       Smith
2        johnsmith@email.com        John Smith   John       Smith
4      harrypotter@email.com               NaN  Harry      Potter
0  chrisalexandrov@gmail.com  Chris Alexandrov  Chris  Alexandrov
5      bettyspring@email.com               NaN  Betty      Spring

In [44]:
df.sort_index()

                       email         full_name  first        last
0  chrisalexandrov@gmail.com  Chris Alexandrov  Chris  Alexandrov
1        marysmith@email.com        Mary Smith   Mary       Smith
2        johnsmith@email.com        John Smith   John       Smith
3        mattdamon@gmail.com               NaN   Matt       Damon
4      harrypotter@email.com               NaN  Harry      Potter
5      bettyspring@email.com               NaN  Betty      Spring